note-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-26 Fri 14:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs note</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">emacs note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdac6f03">note-emacs</a>
<ul>
<li><a href="#org21dde36">emacs tutorial</a></li>
<li><a href="#org6bed1aa">common shortcuts</a></li>
<li><a href="#orgaa0c879">emacs lisp</a>
<ul>
<li><a href="#org8b093a0">blog</a></li>
<li><a href="#org011dc9b">casting spels emacs</a>
<ul>
<li><a href="#org544de25">Syntax and Semantic</a></li>
<li><a href="#orgc32c122">Defining the data for our Game World</a></li>
<li><a href="#orga7596ec">Looking around in our game world</a></li>
</ul>
</li>
<li><a href="#org6031d7f">code</a></li>
</ul>
</li>
<li><a href="#orga41eb7a">orgmode</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdac6f03" class="outline-2">
<h2 id="orgdac6f03">note-emacs</h2>
<div class="outline-text-2" id="text-orgdac6f03">
<p>
the learning environment is mac 
</p>
</div>
<div id="outline-container-org21dde36" class="outline-3">
<h3 id="org21dde36">emacs tutorial</h3>
<div class="outline-text-3" id="text-org21dde36">
<p>
use c-h t open tutorial 
</p>

<p>
c - control  M - option
</p>

<p>
c-x c-c  quit emacs
</p>

<p>
c-g      quit current command
</p>

<pre class="example">


                                上一行 C-p
                                     :
                                     :
               向左移 C-b .... 目前光标位置 .... 向右移 C-f
                                     :
                                     :
                                下一行 C-n

</pre>



<p>
c-/ | c-x u     undo 
</p>

<p>
c-_      undo step by step
</p>

<p>
c-k      delete
</p>

<p>
c-x c-f  search file
</p>

<p>
c-x c-s  save file
</p>

<p>
c-x s    save more buffer
</p>

<p>
c-x c-b | c-x b  search buffer
</p>

<p>
c-s     search forwards
</p>

<p>
c-r     search backwards
</p>

<p>
c-h k ()  query shortcut description
</p>

<p>
c-h f ()  describe function
</p>

<p>
c-h a     search for command g
</p>

<p>
M-x linum-mode   show line number
</p>
</div>
</div>
<div id="outline-container-org6bed1aa" class="outline-3">
<h3 id="org6bed1aa">common shortcuts</h3>
<div class="outline-text-3" id="text-org6bed1aa">
<p class="verse">
,bb  next buffer<br />
<br />
,xf  search file<br />
<br />
,xb  search buffer<br />
,kb  kill buffer<br />
<br />
,ov  my overview current buffer<br />
,c&gt;  org do demote<br />
,c&lt;  org do promote<br />
<br />
&lt;s+Tab  add source<br />
&lt;v+Tab  ignore blank line<br />
&lt;q+Tab  add indentation<br />
<br />
F1  org agenda<br />
<br />
F2  add TODO<br />
c-c c-s add start time<br />
c-c c-d add end time<br />
c-c .   add time period<br />
++1d    every day do<br />
c-x a   org agenda list<br />
<br />
c-c | / |-  auto generate form<br />
c-c -       add  horizontal line<br />
<br />
,x0  close the current window<br />
,x1  close othe windows<br />
,x3   ||<br />
,x2   =<br />
, (12345)  switch window<br />
<br />
spc ss create workspace<br />
spc ll search workspace<br />
<br />
<br />
</p>
</div>
</div>

<div id="outline-container-orgaa0c879" class="outline-3">
<h3 id="orgaa0c879">emacs lisp</h3>
<div class="outline-text-3" id="text-orgaa0c879">
</div>
<div id="outline-container-org8b093a0" class="outline-4">
<h4 id="org8b093a0">blog</h4>
<div class="outline-text-4" id="text-org8b093a0">
<p>
<a href="http://www.woola.net/detail/2016-08-18-elisp.html">http://www.woola.net/detail/2016-08-18-elisp.html</a>
</p>
</div>
</div>
<div id="outline-container-org011dc9b" class="outline-4">
<h4 id="org011dc9b">casting spels emacs</h4>
<div class="outline-text-4" id="text-org011dc9b">
<p>
a comic book : Emacs Lisp version 
<a href="http://www.lisperati.com/casting-spels-emacs/html/casting-spels-emacs-1.html">http://www.lisperati.com/casting-spels-emacs/html/casting-spels-emacs-1.html</a>
</p>

<p>
Emacs <b>scratch</b> buffer is Lisp interacion : c-x b <b>scratch</b>
</p>


<p>
Emacs tutorial <a href="https://www.gnu.org/software/emacs/tour/">https://www.gnu.org/software/emacs/tour/</a>
</p>


<p>
Emacs manual : <a href="https://www.gnu.org/software/emacs/manual/index.html">https://www.gnu.org/software/emacs/manual/index.html</a>
</p>

<p>
c-x c-e  : evaluable each expression (move the cursor to the end of each expression )
</p>

<p>
M-x top-level : clears out errors
</p>

<p>
M-x ielm  : ELISP&gt;
</p>

<p>
(setq eval-expression-print-length nil) : prevent emacs truncate messages
</p>

<p>
(require 'cl) : the library to make elisp run Common lisp command 
</p>
</div>


<div id="outline-container-org544de25" class="outline-5">
<h5 id="org544de25">Syntax and Semantic</h5>
<div class="outline-text-5" id="text-org544de25">
<p>
any text you give elisp interprater has to be arranged into list ,can be nested into lists of
lists,a list in elisp (bla bla bla (abc abc))
</p>

<p>
elis: interprater uses two modes to read code:  Code mode / Data mode. 
in data mode,you can put anything into your list ;
in Code mode, your list need to be special type of list called a form :
</p>

<pre class="example">

(foo bla bla bla)
  ^          ^
  |          |
command     a form
</pre>
</div>
</div>

<div id="outline-container-orgc32c122" class="outline-5">
<h5 id="orgc32c122">Defining the data for our Game World</h5>
<div class="outline-text-5" id="text-orgc32c122">
<p>
in order to learn some more about forms,examples:
</p>
<pre class="example">
(setq objects '(whiskey-bottle bucket frog chain))

| code mode    | The single quote to 'flip' the compiler into Date mode |                                     |   |   |
|--------------+--------------------------------------------------------+-------------------------------------+---+---|
| setq objects | '                                                      | (whiskey-bottle bucket frog chain)) |   |   |
|--------------+--------------------------------------------------------+-------------------------------------+---+---|

</pre>
<p>
the command sets a variable to a value : the variable is objects and the value is a list 
</p>
</div>
</div>

<div id="outline-container-orga7596ec" class="outline-5">
<h5 id="orga7596ec">Looking around in our game world</h5>
<div class="outline-text-5" id="text-orga7596ec">
<p>
The word defun means, as you might expect, that we're defining a function
</p>
<pre class="example">
(defun describe-location (location map)
    (second (assoc location map)))
</pre>
<p>
The assoc command does this and then returns the data describing the living-room
</p>

<p>
Then the command second trims out the second item in that list, which is the description of the living-room
</p>
</div>
</div>
</div>

<div id="outline-container-org6031d7f" class="outline-4">
<h4 id="org6031d7f">code</h4>
<div class="outline-text-4" id="text-org6031d7f">
<div class="org-src-container">
<pre class="src src-elisp">
(<span style="color: #66D9EF;">setq</span> objects '(whiskey-bottle bucket frog chain))

(<span style="color: #66D9EF;">setq</span> object-locations '((whiskey-bottle living-room)
                           (bucket living-room)
                           (chain garden)
                           (frog garden)))

(<span style="color: #66D9EF;">setq</span> location 'living-room)

(<span style="color: #66D9EF;">setq</span> map '((living-room (you are in the living room
                of a wizards house - there is a wizard
                snoring loudly on the couch -)
                (west door garden)
                (upstairs stairway attic))
              (garden (you are in a beautiful garden -
                there is a well in front of you -)
                (east door living-room))
              (attic (you are in the attic of the
                wizards house - there is a giant
                welding torch in the corner -)
                (downstairs stairway living-room))))

(<span style="color: #66D9EF;">defun</span> <span style="color: #F92672; font-style: italic;">describe-location</span> (location map)
    (second (assoc location map)))


(describe-location 'living-room map)

(message <span style="color: #E6DB74;">"hello world"</span>)

(<span style="color: #66D9EF;">defun</span> <span style="color: #F92672; font-style: italic;">hello-world</span> (name)
 <span style="color: #E6DB74; font-style: italic;">"say hello to user whose name is XX"</span>
   (message <span style="color: #E6DB74;">"hello , %s"</span> name))

(hello-world <span style="color: #E6DB74;">"manue1"</span>)

(<span style="color: #66D9EF;">setq</span> foo <span style="color: #E6DB74;">"i'm manue1"</span>)
(message foo)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga41eb7a" class="outline-3">
<h3 id="orga41eb7a">orgmode</h3>
<div class="outline-text-3" id="text-orga41eb7a">
<ul class="org-ul">
<li>alt键失灵问题,主要是因为xshell的配置问题
文件&#x2013;&gt;属性&#x2013;&gt;终端&#x2013;&gt;键盘&#x2013;&gt;元(meta)键仿真</li>
<li><a href="http://www.github.com/nanue1">nanue1's github</a>
<ul class="org-ul">
<li>c-c c-l 
创建url</li>
<li>c-c c-o
打开url</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>